import pandas as pd
import matplotlib.pyplot as plt

# Данные обрезаны для примера (для ускорения обработки)
data = {
    "timestamp": [
         "01.04.2024", "01.05.2024", "01.06.2024", "01.07.2024",
        "01.08.2024", "01.09.2024", "01.10.2024", "01.11.2024", "01.12.2024", "01.01.2025",
        "01.02.2025", "01.03.2025", "01.04.2025"
    ],
    "капитализация Bitcoin": [
    110507976757975.77,
    124273181208850.66,
    111749075696378.86,
    109067233663671.8,
    100148544586139.42,
    113299526550796.19,
    129140592802001.22,
    185833730430915.56,
    196975223618275.84,
    230840014404981.5,
    164927358658499.84,
    146359084889890.16,
    155294201705451.2
    ],

    "капитализация Ethereum":  [
    34027371146916.035,
    42208823092881.57,
    37304615293538.125,
    33229800260096.734,
    26004361808963.773,
    28366517602180.586,
    28172489347061.516,
    43465488394066.69,
    42740871819143.6,
    45222049766985.55,
    26599074585470.55,
    19657136251783.36,
    17978421618519.652
    ],


    "капитализация USDT": [ 
    10235399727998.139,
    10454537193434.098,
    10192749739498.01,
    9786668579682.35,
    10166441062882.201,
    10828468446310.932,
    11198233916530.059,
    13055367883587.096,
    14642216977067.383,
    15851295617968.354,
    14010448734625.713,
    12856651089211.078,
    12321888859811.668
    ], 
}

# Создание DataFrame
df = pd.DataFrame(data)
df["timestamp"] = pd.to_datetime(df["timestamp"], format="%d.%m.%Y")

# Перевод капитализации в миллиарды для удобства отображения
df["капитализация Bitcoin"] = df["капитализация Bitcoin"] / 1e9
df["капитализация Ethereum"] = df["капитализация Ethereum"] / 1e9
df["капитализация USDT"] = df["капитализация USDT"] / 1e9

# Построение графика
plt.figure(figsize=(12, 6))
plt.plot(df["timestamp"], df["капитализация Bitcoin"], label="Bitcoin")
plt.plot(df["timestamp"], df["капитализация Ethereum"], label="Ethereum")
plt.plot(df["timestamp"], df["капитализация USDT"], label="USDT")

plt.title("Капитализация криптовалют (в млрд $)")
plt.xlabel("Дата")
plt.ylabel("Капитализация (млрд $)")
plt.legend()
plt.grid(True)
plt.tight_layout()

plt.savefig("capitalisation_plot_last_year.png")

